app/views/microposts/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %><br>
    <%= f.collection_select :user_id, User::all, :id, :email %>